---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.TilePatternFamrefComponentExtents
source: html/ec0fe1be-9c05-b956-c4c8-eddf8f70a25b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.TilePatternFamrefComponentExtents Property

"Component Extents"

## Syntax (C#)
```csharp
public static ForgeTypeId TilePatternFamrefComponentExtents { get; }
```